CAFA_SA/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    cellDisplacement
    {
	    solver          GAMG;
	    smoother        GaussSeidel;
	    tolerance       1e-7;
	    relTol          0.01;
    }
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.01;
    }
    Phi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-10;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0.05;
        nSweeps         1;
    }

    nuTilda
    {
        solver      smoothSolver;
        smoother    symGaussSeidel;
        tolerance   1e-8;
        relTol      0.1;      // or 0.05 if you want more robust
        nSweeps     1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    consistent yes;
    residualControl
    {
        p       1e-5;   // optional per-field convergence for SIMPLE outer loop
        U       1e-8;
        nuTilda       1e-8;

    }
}


potentialFlow
{
    nNonOrthogonalCorrectors 5;
}

relaxationFactors
{
    fields
    {
        p 0.3;
    }
    equations
    {
        U               0.5;
        nuTilda 0.3;   // 0.2–0.4 typical

        nut             0.7;

    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
